# Найдите сумму цифр трехзначного числа.


number = input('Введите трех значное число: ')
sum_1 = int(number[0]) + int(number[1]) + int(number[2])
print('Сумма чисел = ', sum_1)
