# Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не
# меньше заданного минимума и не больше заданного
# максимума)


# Ввод: [-5, 9, 0, 3, -1, -2, 1,
# 4, -2, 10, 2, 0, -9, 8, 10, -9,
# 0, -5, -5, 7]
# Вывод: [1, 9, 13, 14, 19]

from random import randint
a  = []
d = []
for i in range(1, 20):
    a.append(randint(-20, 20))
print(a)

b = int(input('Введите минимум: '))
c = int(input('Введите максимум: '))

for i in range(len(a)):
    if c >= a[i] and b <= a[i]:
        d.append(i)
print(d)
